In [1]:
!git clone https://github.com/Mazen-Hany-Abdelsalam-Hassan/InstructionFineTuning.git

Cloning into 'InstructionFineTuning'...
remote: Enumerating objects: 122, done.
remote: Counting objects: 100% (122/122), done.
remote: Compressing objects: 100% (82/82), done.
remote: Total 122 (delta 66), reused 91 (delta 36), pack-reused 0 (from 0)
Receiving objects: 100% (122/122), 5.45 MiB | 11.90 MiB/s, done.
Resolving deltas: 100% (66/66), done.

In [ ]:
! pip install -r requirements.txt

In [2]:
import os 
import sys
os.chdir("InstructionFineTuning")
sys.path.append("src")
from src import create_loaders
from src import GPT_INSTRUCTION_FINE_TUNED

In [3]:
train_loader , eval_loader , test_loader = create_loaders("/kaggle/input/instruction-fine-tuning-data/SQL_Sample.csv",batch_size = 1)

In [4]:
model = GPT_INSTRUCTION_FINE_TUNED('XL', rank = 16)

Downloaded to /kaggle/working/InstructionFineTuning/BASEModel/gpt2-xl-1558M.pth

In [5]:
import torch.optim as optim
optimizer = optim.Adam(model.parameters(), lr=0.0001)

In [6]:
from src.train_and_evaluate import train

for name, layer in model.named_parameters():
    print(name , layer.requires_grad)

In [ ]:
train(model = model ,train_loader = train_loader ,val_loader = eval_loader ,optimizer = optimizer,num_epochs =1,log_freq = 500)

 epoch num 1  step num 0 / 32000 loss training =3.626727819442749 , val_loss = 3.1501309394836428
generated_response  : CREATE TABLE table_12834315_5 (
   name VARCHAR,
   barrel_profile VARCHAR
)
### Input:
CREATE TABLE table_12834315_5 (
   name VARCHAR,
   barrel_profile VARCHAR
)
### Response:
CREATE TABLE table_12834315_5 (
   name VARCHAR,
   barrel_profile VARCHAR
)
  ground_truth_reponse :  SELECT name FROM table_12834315_5 WHERE barrel_profile = "A2"



generated_response  : CREATE TABLE table_57917 (
    "Race" text,
     "Circuit" text,
     "Date" text,
      "Pole position" text,
       "Fastest lap" text,
       "Winning driver" text,
       "Constructor" text,
       "
  ground_truth_reponse :  SELECT "Date" FROM table_57917 WHERE "Tyre" = 'd' AND "Circuit" = 'monaco'



generated_response  : CREATE TABLE table_23649244_2 (
    level VARCHAR,
    artist_1 VARCHAR,
    artist_2 VARCHAR
)
### Input:
CREATE TABLE table_23649244_3 (
    level VARCHAR,
    artist_1 VARCHAR,
    artist_2 VARCHAR
)
### Response:
CREATE TABLE table
  ground_truth_reponse :  SELECT level FROM table_23649244_1 WHERE artist_1 = "Marvin Gaye" AND artist_2 = "David Bowie"



generated_response  : SELECT * FROM membership_register_branch

SELECT * FROM member

### Output:

SELECT * FROM membership_register_branch

SELECT * FROM member

### Output:

SELECT * FROM membership_register_branch

SELECT * FROM member

### Output:

SELECT * FROM membership_register_branch

SELECT * FROM member

### Output:

SELECT * FROM membership_register_branch

SELECT
  ground_truth_reponse :  SELECT name FROM member WHERE NOT member_id IN (SELECT member_id FROM membership_register_branch)



generated_response  : CREATE TABLE table_36593_response (
    "Date" text,
     "Visitor" text,
     "Score" text,
     "Home" text,
     "Record" text,
     "Attendance" real
)
### Input:
CREATE TABLE table_36593_response_response (
     "Date" text,
  ground_truth_reponse :  SELECT "Home" FROM table_36593 WHERE "Date" = 'december 5'



 epoch num 1  step num 500 / 32000 loss training =0.8903889316916466 , val_loss = 0.7140108048915863
generated_response  : SELECT courtesy_title FROM table_name_1 WHERE tenure = "1766 1794"<|endoftext|>
  ground_truth_reponse :  SELECT courtesy_title FROM table_name_1 WHERE tenure = "1766–1794"



generated_response  : SELECT COUNT(attendance) FROM table_name_98 WHERE score = "0:0 - 4:1 (pen)"<|endoftext|>
  ground_truth_reponse :  SELECT AVG(attendance) FROM table_name_98 WHERE score = "0:0 - 4:1 (pen)"



generated_response  : SELECT COUNT("no.") FROM table_203_473 WHERE "no." = 'scott simpson'<|endoftext|>
  ground_truth_reponse :  SELECT COUNT(*) FROM table_203_473 WHERE "runner(s)-up" = 'scott simpson'



generated_response  : SELECT AVG(total) FROM table_name_39 WHERE finish = "t11"<|endoftext|>
  ground_truth_reponse :  SELECT AVG(total) FROM table_name_39 WHERE finish = "t11"



generated_response  : SELECT date_s__conducted FROM table_name_69 WHERE plaid_cymru = "19%"<|endoftext|>
  ground_truth_reponse :  SELECT date_s__conducted FROM table_name_69 WHERE plaid_cymru = "19%"



 epoch num 1  step num 1000 / 32000 loss training =0.715669978260994 , val_loss = 0.6580015569925308
generated_response  : SELECT COUNT(*) FROM film GROUP BY COUNT(*)<|endoftext|>
  ground_truth_reponse :  SELECT studio FROM film GROUP BY studio HAVING AVG(gross_in_dollar) >= 4500000



generated_response  : SELECT "Team" FROM table_68794 WHERE "Qual 2" = '1:44.050'<|endoftext|>
  ground_truth_reponse :  SELECT "Best" FROM table_68794 WHERE "Qual 2" = '1:44.050'



generated_response  : SELECT COUNT("Points") FROM table_34903 WHERE "Season" = '20' AND "Driver" = 'fernando alonso'<|endoftext|>
  ground_truth_reponse :  SELECT SUM("Points") FROM table_34903 WHERE "Races" = '20' AND "Driver" = 'fernando alonso'



generated_response  : SELECT song_choice FROM table_name_82 WHERE theme = "n/a" AND week__number = "hollywood"<|endoftext|>
  ground_truth_reponse :  SELECT song_choice FROM table_name_82 WHERE theme = "n/a" AND week__number = "hollywood"



generated_response  : SELECT Investors FROM people GROUP BY Investors ORDER BY COUNT(Investors)<|endoftext|>
  ground_truth_reponse :  SELECT Investor, COUNT(*) FROM entrepreneur GROUP BY Investor



 epoch num 1  step num 1500 / 32000 loss training =0.6956906409263611 , val_loss = 0.7110499531030655
generated_response  : SELECT SUM(year) FROM table_name_57 WHERE location = "newport, rhode island"<|endoftext|>
  ground_truth_reponse :  SELECT SUM(year) FROM table_name_57 WHERE location = "newport, rhode island"



generated_response  : SELECT AVG(bronze) FROM table_name_64 WHERE nation = "south africa (rsa)" AND total > 16<|endoftext|>
  ground_truth_reponse :  SELECT MAX(bronze) FROM table_name_64 WHERE nation = "south africa (rsa)" AND total > 16



generated_response  : SELECT "pages per minute (color)" FROM table_47242 WHERE "max page size" = 'a4' AND "dimensions (mm)" = '303 x 94 x 60'<|endoftext|>
  ground_truth_reponse :  SELECT "pages per minute (color)" FROM table_47242 WHERE "max page size" = 'a4' AND "dimensions (mm)" = '303 x 94 x 60'



generated_response  : SELECT "Years produced" FROM table_28589 WHERE "Cylinder Layout" = 'v8'<|endoftext|>
  ground_truth_reponse :  SELECT "Years produced" FROM table_28589 WHERE "Cylinder Layout" = 'V8'



generated_response  : SELECT COUNT(*) FROM PersonFriend WHERE friend > age AND friend < age<|endoftext|>
  ground_truth_reponse :  SELECT friend, age FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name = T2.friend WHERE T1.age > (SELECT AVG(age) FROM Person)



 epoch num 1  step num 2000 / 32000 loss training =0.6550632032752037 , val_loss = 0.7318611085414887
generated_response  : SELECT minister FROM party_events WHERE party_id = "Progress Party"<|endoftext|>
  ground_truth_reponse :  SELECT minister FROM party WHERE party_name <> 'Progress Party'



generated_response  : SELECT MAX(largest_ethnic_group__2002_) FROM table_2562572_27 WHERE settlement = "Gunaro"<|endoftext|>
  ground_truth_reponse :  SELECT largest_ethnic_group__2002_ FROM table_2562572_27 WHERE settlement = "Gunaroš"



generated_response  : SELECT name FROM playlist_tracks WHERE playlist_id = "music" AND track_id = "1"<|endoftext|>
  ground_truth_reponse :  SELECT T1.name FROM tracks AS T1 JOIN playlist_tracks AS T2 ON T1.id = T2.track_id JOIN playlists AS T3 ON T2.playlist_id = T3.id WHERE T3.name = 'Movies' INTERSECT SELECT T1.name FROM tracks AS T1 JOIN playlist_tracks AS T2 ON T1.id = T2.track_id JOIN playlists AS T3 ON T2.playlist_id = T3.id WHERE T3.name = 'Music'



generated_response  : SELECT name FROM Person WHERE friend = "No"<|endoftext|>
  ground_truth_reponse :  SELECT name FROM Person EXCEPT SELECT T2.name FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name = T2.friend WHERE T1.job = 'student'



generated_response  : SELECT "Opponent in the final" FROM table_34782 WHERE "Partner" = 'jorgelina cravero'<|endoftext|>
  ground_truth_reponse :  SELECT "Opponent in the final" FROM table_34782 WHERE "Partner" = 'jorgelina cravero'



 epoch num 1  step num 2500 / 32000 loss training =0.6260723355412483 , val_loss = 0.5961535036563873
generated_response  : SELECT "Date" FROM table_20244 WHERE "Cover model" = 'oliver stone'<|endoftext|>
  ground_truth_reponse :  SELECT "Date" FROM table_20244 WHERE "Interview subject" = 'Oliver Stone'



generated_response  : SELECT MAX(total) FROM table_19744915_18 WHERE couple = "Ellery and Frankie"<|endoftext|>
  ground_truth_reponse :  SELECT MAX(total) FROM table_19744915_18 WHERE couple = "Ellery and Frankie"



generated_response  : SELECT SUM("Form") FROM table_32935 WHERE "Pages" > '17' AND "Total" = '$1,801,154'<|endoftext|>
  ground_truth_reponse :  SELECT SUM("Form") FROM table_32935 WHERE "Pages" > '17' AND "Total Assets" = '$1,801,154'



generated_response  : SELECT "Crowd" FROM table_33046 WHERE "Home team" = 'windy hill vfl'<|endoftext|>
  ground_truth_reponse :  SELECT SUM("Crowd") FROM table_33046 WHERE "Venue" = 'windy hill'



generated_response  : SELECT "Color commentator(s)" FROM table_33472 WHERE "Year" = '2003'<|endoftext|>
  ground_truth_reponse :  SELECT "Color commentator(s)" FROM table_33472 WHERE "Play-by-play" = 'al michaels' AND "Year" > '2003'



 epoch num 1  step num 3000 / 32000 loss training =0.6259219629466534 , val_loss = 0.6560288429260254
generated_response  : SELECT COUNT(year) FROM table_name_74 WHERE record = "73-65"<|endoftext|>
  ground_truth_reponse :  SELECT COUNT(year) FROM table_name_74 WHERE record = "73-65"



generated_response  : SELECT best_3_year_period FROM table_name_61 WHERE best_15_year_period = "smyslov" AND position = "5"<|endoftext|>
  ground_truth_reponse :  SELECT best_3_year_period FROM table_name_61 WHERE best_15_year_period = "smyslov; kasparov" AND position = 5



generated_response  : SELECT Position FROM pilot_record<|endoftext|>
  ground_truth_reponse :  SELECT Position, COUNT(Position) FROM pilot GROUP BY Position



generated_response  : SELECT "NHL team" FROM table_4354 WHERE "Player" = 'mike gaffney'<|endoftext|>
  ground_truth_reponse :  SELECT "NHL team" FROM table_4354 WHERE "Player" = 'mike gaffney'



generated_response  : SELECT team_1 FROM table_name_99 WHERE team_2 = "renova"<|endoftext|>
  ground_truth_reponse :  SELECT team_1 FROM table_name_99 WHERE team_2 = "renova"



 epoch num 1  step num 3500 / 32000 loss training =0.6017153657078743 , val_loss = 0.7133735209703446
generated_response  : SELECT "West" FROM table_45935 WHERE "East" = 'eastern sebensbach'<|endoftext|>
  ground_truth_reponse :  SELECT "West" FROM table_45935 WHERE "East" = 'esv gebensbach'



generated_response  : SELECT Team_ID, ACC_Percent FROM basketball_match<|endoftext|>
  ground_truth_reponse :  SELECT Team_ID, ACC_Percent FROM basketball_match GROUP BY All_Road



generated_response  : SELECT "Competition" FROM table_44310 WHERE "Date" = '30 december 2005'<|endoftext|>
  ground_truth_reponse :  SELECT "Competition" FROM table_44310 WHERE "Date" = '30 december 2005'



generated_response  : SELECT country FROM stadium WHERE capacity > 60000 AND stadiums < 50000<|endoftext|>
  ground_truth_reponse :  SELECT country FROM stadium WHERE capacity > 60000 INTERSECT SELECT country FROM stadium WHERE capacity < 50000



generated_response  : SELECT method FROM table_name_35 WHERE round = "3"<|endoftext|>
  ground_truth_reponse :  SELECT method FROM table_name_35 WHERE round = 3



 epoch num 1  step num 4000 / 32000 loss training =0.6085224037468433 , val_loss = 0.5776664674282074
generated_response  : SELECT "Score" FROM table_7841 WHERE "Country" = 'united states' AND "Place" = 't2' AND "Player" = 'tom watson'<|endoftext|>
  ground_truth_reponse :  SELECT "Score" FROM table_7841 WHERE "Country" = 'united states' AND "Place" = 't2' AND "Player" = 'tom watson'



generated_response  : SELECT MIN("Ovrs") FROM table_71689 WHERE "Wkts" = '0'<|endoftext|>
  ground_truth_reponse :  SELECT MIN("Ovrs") FROM table_71689 WHERE "Wkts" = '0'



generated_response  : SELECT 2007 FROM table_name_7 WHERE 2003 = "2r" AND 2004 = "1r"<|endoftext|>
  ground_truth_reponse :  SELECT 2007 FROM table_name_7 WHERE 2003 = "2r" AND 2004 = "1r"



generated_response  : SELECT "Power" FROM table_57943 WHERE "Engine" = '1972'<|endoftext|>
  ground_truth_reponse :  SELECT "Power" FROM table_57943 WHERE "Years" = '1972'



generated_response  : SELECT MAX(season__number) FROM table_12419515_5 WHERE written_by = "Adam Milch"<|endoftext|>
  ground_truth_reponse :  SELECT MIN(season__number) FROM table_12419515_5 WHERE written_by = "Adam Milch"



 epoch num 1  step num 4500 / 32000 loss training =0.5943550826609134 , val_loss = 0.46573817282915114
generated_response  : SELECT COUNT("Fleet Series (Quantity)" FROM table_15849 WHERE "Fleet Series (Quantity)" = '468-473 (6)'<|endoftext|>
  ground_truth_reponse :  SELECT COUNT("Order Year") FROM table_15849 WHERE "Fleet Series (Quantity)" = '468-473 (6)'



generated_response  : SELECT "Series" FROM table_41916 WHERE "Launch date" = '23 february 2013'<|endoftext|>
  ground_truth_reponse :  SELECT "Series" FROM table_41916 WHERE "Launch date" = '23 february 2013'



generated_response  : SELECT "head coach" FROM table_203_814 WHERE "season" > '2012-'13' AND "overall record" = '9-7' AND "conference record" = '9-7'<|endoftext|>
  ground_truth_reponse :  SELECT "head coach" FROM table_203_814 WHERE "season" = (SELECT "season" FROM table_203_814 WHERE "head coach" = 'marty brill' ORDER BY "season" DESC LIMIT 1) + 1



generated_response  : SELECT "Place of action" FROM table_54319 WHERE "Rank" = 'Corporal' AND "Unit" = 'Marine Corps'<|endoftext|>
  ground_truth_reponse :  SELECT "Place of action" FROM table_54319 WHERE "Service" = 'marine corps' AND "Rank" = 'corporal'



generated_response  : SELECT "Location Attendance" FROM table_44932 WHERE "Date" = 'december 30'<|endoftext|>
  ground_truth_reponse :  SELECT "Location Attendance" FROM table_44932 WHERE "Date" = 'december 30'



 epoch num 1  step num 5000 / 32000 loss training =0.6076335593760014 , val_loss = 0.6287349164485931
generated_response  : SELECT "Result" FROM table_49504 WHERE "Date" = 'November 29, 2001'<|endoftext|>
  ground_truth_reponse :  SELECT "Result" FROM table_49504 WHERE "Date" = 'november 29, 2001'



generated_response  : SELECT "Top speed" FROM table_27083 WHERE "0\u2013100km/h (60mph)" = '5.5 seconds (5.2)'<|endoftext|>
  ground_truth_reponse :  SELECT "Top speed" FROM table_27083 WHERE "0\u2013100km/h (60mph)" = '5.5 seconds (5.2)'



generated_response  : SELECT opponent_in_the_final FROM table_name_91 WHERE tournament = "kuban"<|endoftext|>
  ground_truth_reponse :  SELECT opponent_in_the_final FROM table_name_91 WHERE tournament = "kuwait"



generated_response  : SELECT ihsaa_class__football_ FROM table_name_24 WHERE mascot = "generals"<|endoftext|>
  ground_truth_reponse :  SELECT ihsaa_class__football_ FROM table_name_24 WHERE mascot = "generals"



generated_response  : SELECT rider_names FROM table_27833186_1 WHERE best_conditioned_horse = "Basia"<|endoftext|>
  ground_truth_reponse :  SELECT rider_names FROM table_27833186_1 WHERE best_conditioned_horse = "Basia"



 epoch num 1  step num 5500 / 32000 loss training =0.5886607247292995 , val_loss = 0.6059282213449478
generated_response  : SELECT AVG(a_krajka) FROM table_name_60 WHERE rank < 6 AND r_magjistari = 6 AND d_tukiqi = 6<|endoftext|>
  ground_truth_reponse :  SELECT AVG(a_krajka) FROM table_name_60 WHERE r_magjistari < 6 AND d_tukiqi = 6 AND rank < 5



generated_response  : SELECT COUNT(population__2000_census_) FROM table_22916979_2 WHERE census_designated_place = "Westmont"<|endoftext|>
  ground_truth_reponse :  SELECT COUNT(population__2000_census_) FROM table_22916979_2 WHERE census_designated_place = "Westmont"



generated_response  : SELECT MAX(attendance) FROM table_name_16 WHERE week < 1<|endoftext|>
  ground_truth_reponse :  SELECT SUM(attendance) FROM table_name_16 WHERE week < 1



generated_response  : SELECT "Release date" FROM table_22161 WHERE "Function" = 'Metronome'<|endoftext|>
  ground_truth_reponse :  SELECT "Release date" FROM table_22161 WHERE "Title" = 'Metronome'



generated_response  : SELECT MAX(obama_number) FROM table_20688030_1 WHERE county = "Wayne"<|endoftext|>
  ground_truth_reponse :  SELECT MAX(obama_number) FROM table_20688030_1 WHERE county = "Wayne"



 epoch num 1  step num 6000 / 32000 loss training =0.587260027974844 , val_loss = 0.5313033118844033
generated_response  : SELECT Position, COUNT(Position) FROM pilot GROUP BY Position<|endoftext|>
  ground_truth_reponse :  SELECT Position, COUNT(Position) FROM pilot GROUP BY Position



generated_response  : SELECT MIN(react) FROM table_name_50 WHERE lane = "5"<|endoftext|>
  ground_truth_reponse :  SELECT MIN(react) FROM table_name_50 WHERE lane = 5



generated_response  : SELECT "date" FROM table_203_336 WHERE "win" = '#'<|endoftext|>
  ground_truth_reponse :  SELECT "date" FROM table_203_336 WHERE "win" = 'murray' AND "date" > 6 ORDER BY "date" LIMIT 1



generated_response  : SELECT 3 AS nd_liga FROM table_name_36 WHERE date = "2008-09"<|endoftext|>
  ground_truth_reponse :  SELECT 3 AS rd_liga_3rd FROM table_name_36 WHERE game_1 = "0-1" AND date = "2008-09"



generated_response  : SELECT tournament FROM table_name_38 WHERE date = "9 august 1993"<|endoftext|>
  ground_truth_reponse :  SELECT tournament FROM table_name_38 WHERE date = "9 august 1993"



 epoch num 1  step num 6500 / 32000 loss training =0.5846252929568291 , val_loss = 0.670164430141449
generated_response  : SELECT "Leader" FROM table_9514 WHERE "% of seats" = 'spoilt votes' = '%'<|endoftext|>
  ground_truth_reponse :  SELECT "Leader" FROM table_9514 WHERE "% of seats" = 'spoilt votes'



generated_response  : SELECT class FROM table_name_78 WHERE quantity_preserved = "0" AND quantity_made = "5"<|endoftext|>
  ground_truth_reponse :  SELECT class FROM table_name_78 WHERE quantity_preserved = "0" AND quantity_made = "5"



generated_response  : SELECT "Interview" FROM table_20634 WHERE "Preliminary Average" = '8.662 (3)'<|endoftext|>
  ground_truth_reponse :  SELECT "Interview" FROM table_20634 WHERE "Preliminary Average" = '8.662 (3)'



generated_response  : SELECT name FROM table_name_26 WHERE current_status = "demolished" AND location = "toolamba"<|endoftext|>
  ground_truth_reponse :  SELECT name FROM table_name_26 WHERE current_status = "demolished" AND location = "toolamba"



generated_response  : SELECT "Crowd" FROM table_33555 WHERE "Home team" = 'essendon'<|endoftext|>
  ground_truth_reponse :  SELECT "Crowd" FROM table_33555 WHERE "Home team" = 'essendon'



 epoch num 1  step num 7000 / 32000 loss training =0.5809101380854845 , val_loss = 0.3762397259473801
generated_response  : SELECT power__kw_ FROM table_name_75 WHERE location = "metro manila"<|endoftext|>
  ground_truth_reponse :  SELECT power__kw_ FROM table_name_75 WHERE location = "metro manila"



generated_response  : SELECT "First elected" FROM table_679 WHERE "Incumbent" = 'Jim Ramstad'<|endoftext|>
  ground_truth_reponse :  SELECT MIN("First elected") FROM table_679 WHERE "Incumbent" = 'Jim Ramstad'



generated_response  : SELECT "Original NFL team" FROM table_66522 WHERE "Conf." = 'midwestern conference'<|endoftext|>
  ground_truth_reponse :  SELECT "Original NFL team" FROM table_66522 WHERE "Conf." = 'midwestern'



generated_response  : SELECT year FROM table_name_44 WHERE team = "andretti autosport"<|endoftext|>
  ground_truth_reponse :  SELECT COUNT(year) FROM table_name_44 WHERE team = "andretti autosport"



generated_response  : SELECT "City" FROM table_6036 WHERE "State" = 'massachusetts' AND "School" = 'northeastern university'<|endoftext|>
  ground_truth_reponse :  SELECT "City" FROM table_6036 WHERE "State" = 'massachusetts' AND "School" = 'northeastern university'



 epoch num 1  step num 7500 / 32000 loss training =0.5572363158464432 , val_loss = 0.5918561592698097
generated_response  : SELECT outcome FROM table_name_72 WHERE partner = "jordan kerr" AND date = "11 october 2009"<|endoftext|>
  ground_truth_reponse :  SELECT outcome FROM table_name_72 WHERE partner = "jordan kerr" AND date = "11 october 2009"



generated_response  : SELECT english FROM table_name_26 WHERE dutch = "tong"<|endoftext|>
  ground_truth_reponse :  SELECT english FROM table_name_26 WHERE dutch = "tong"



generated_response  : SELECT 2 AS nd_party FROM table_name_82 WHERE election = "1865"<|endoftext|>
  ground_truth_reponse :  SELECT 2 AS nd_party FROM table_name_82 WHERE election = "1865"



generated_response  : SELECT Affiliation, COUNT(*) FROM basketball_match GROUP BY Affiliation<|endoftext|>
  ground_truth_reponse :  SELECT Affiliation, SUM(Enrollment) FROM university WHERE Founded > 1850 GROUP BY Affiliation




In [7]:
train(model = model ,train_loader = train_loader ,val_loader = eval_loader ,optimizer = optimizer,num_epochs =3)

 epoch num 1  step num 0 / 8000 loss training =3.290363073348999 , val_loss = 3.1180498361587525
generated_response  : ### Input:
SELECT * FROM table_name_49
### Output:
### Input:
SELECT * FROM table_name_49
### Output:
### Input:
SELECT * FROM table_name_49
### Output:
### Input:
SELECT * FROM table_name_49
### Output:
### Input:
SELECT * FROM table_name_49
### Output:
### Input:
SELECT * FROM table_name_49
### Output
  ground_truth_reponse :  SELECT res FROM table_name_49 WHERE competition = "friendly match"



generated_response  : ### Instruction:
What was the home team's score when they played at Lake Oval?
### Input:
CREATE TABLE table_33322 (
    "Home team" text,
    "Home team score" text,
    "Away team" text,
    "Away team score" text,
    "Venue" text,
    "Crowd" real,
    "
  ground_truth_reponse :  SELECT "Home team score" FROM table_33322 WHERE "Venue" = 'lake oval'



generated_response  : ### Input:
SELECT  country,  language_s_,  literary_tradition FROM  table_name_99
### Output:
### Input:
SELECT  country,  language_s_,  literary_tradition FROM  table_name_99
### Output:
### Input:
SELECT  country,  language_s_,  literary_tradition FROM
  ground_truth_reponse :  SELECT country FROM table_name_99 WHERE language_s_ = "english" AND literary_tradition = "canadian literature"



generated_response  : SELECT * FROM table_name_53
### Instruction:
Which player was from Fermanagh and had an average score of 22?
### Input:
CREATE TABLE table_name_54 (
    average INTEGER,

    total VARCHAR,

    county VARCHAR

)

### Response:
SELECT * FROM table_name_54

### Instruction:
Which player was from Fermanagh
  ground_truth_reponse :  SELECT AVG(average) FROM table_name_53 WHERE total = 22 AND county = "fermanagh"



generated_response  : ### Instruction:
### Input:
### Response:
### Instruction:
### Input:
### Response:
### Instruction:
### Input:
### Response:
### Instruction:
### Input:
### Response:
### Instruction:
### Input:
### Response:
### Instruction:
### Input:
### Response:
### Instruction:
### Input:
### Response:
### Instruction:
### Input:
### Response:
### Instruction:

  ground_truth_reponse :  SELECT "Candidate" FROM table_8478 WHERE "Number of votes" = '73,494'



 epoch num 1  step num 50 / 8000 loss training =1.2629346871376037 , val_loss = 0.9252786636352539
generated_response  : SELECT "Original air date" FROM table_72652 WHERE "Production code" = '318'<|endoftext|>
  ground_truth_reponse :  SELECT "Original air date" FROM table_72652 WHERE "Production code" = '318'



generated_response  : SELECT country FROM table_name_62 WHERE city = "san juan"<|endoftext|>
  ground_truth_reponse :  SELECT country FROM table_name_62 WHERE city = "san juan"



generated_response  : SELECT "Score" FROM table_34481 WHERE "Opponent" = '3'<|endoftext|>
  ground_truth_reponse :  SELECT MIN("Game") FROM table_34481 WHERE "Score" = '3–4'



generated_response  : SELECT tonnage_grt FROM table_name_84 WHERE nationality = "british" AND ship = "kidalton"<|endoftext|>
  ground_truth_reponse :  SELECT MIN(tonnage_grt) FROM table_name_84 WHERE nationality = "british" AND ship = "kidalton"



generated_response  : SELECT "Release" FROM table_30594 WHERE "Version" = '1.0.12'<|endoftext|>
  ground_truth_reponse :  SELECT COUNT("Version") FROM table_30594 WHERE "Release" = '1.0.12'



 epoch num 1  step num 100 / 8000 loss training =0.885495001077652 , val_loss = 0.8296410322189331
generated_response  : SELECT result FROM table_name_12 WHERE tournament = "US Open"<|endoftext|>
  ground_truth_reponse :  SELECT 2012 FROM table_name_12 WHERE tournament = "us open"



generated_response  : SELECT COUNT("Family/families") FROM table_23391 WHERE "Jeans family" = 'jeans'<|endoftext|>
  ground_truth_reponse :  SELECT COUNT("No. in season") FROM table_23391 WHERE "Family/families" = 'The Jeans Family'



generated_response  : SELECT Price FROM Products AS Price GROUP BY Founder ORDER BY Price DESC<|endoftext|>
  ground_truth_reponse :  SELECT T1.Name, T1.Price FROM Products AS T1 JOIN Manufacturers AS T2 ON T1.Manufacturer = T2.Code GROUP BY Founder, T1.Name ORDER BY T1.Name



generated_response  : SELECT opponents FROM table_name_92 WHERE positional_or_automatic = "no material" AND material_or_non_material = "no material" AND 3 suits = "3"<|endoftext|>
  ground_truth_reponse :  SELECT opponents FROM table_name_92 WHERE positional_or_automatic = "positional" AND material_or_non_material = "no" AND suits = "3"



generated_response  : SELECT COUNT("back vocal") FROM vocals WHERE songid = "back vocal"<|endoftext|>
  ground_truth_reponse :  SELECT DISTINCT title FROM vocals AS t1 JOIN songs AS t2 ON t1.songid = t2.songid EXCEPT SELECT t2.title FROM vocals AS t1 JOIN songs AS t2 ON t1.songid = t2.songid WHERE TYPE = "back"



 epoch num 1  step num 150 / 8000 loss training =0.8251959586143494 , val_loss = 0.8479480564594268
generated_response  : SELECT "Family/families" FROM table_23391 WHERE "Season number" = '1' AND "Family/families" = 'jeans'<|endoftext|>
  ground_truth_reponse :  SELECT COUNT("No. in season") FROM table_23391 WHERE "Family/families" = 'The Jeans Family'



generated_response  : SELECT "Director(s)" FROM table_38304 WHERE "Prize" = '2,000,000'<|endoftext|>
  ground_truth_reponse :  SELECT "Director(s)" FROM table_38304 WHERE "Prize" = '¥2,000,000'



generated_response  : SELECT venue FROM table_name_38 WHERE host = "saint joseph's"<|endoftext|>
  ground_truth_reponse :  SELECT venue FROM table_name_38 WHERE host = "saint joseph's university"



generated_response  : SELECT "State" FROM table_31695 WHERE "Region" = 'knoxtown' AND "Host" = 'mideast' AND "Mideast Region" = 'knoxtown'<|endoftext|>
  ground_truth_reponse :  SELECT "State" FROM table_31695 WHERE "Region" = 'mideast' AND "City" = 'knoxville'



generated_response  : SELECT SUM(Date_Claim_Made) FROM Payments GROUP BY Date_Claim_Made<|endoftext|>
  ground_truth_reponse :  SELECT Date_Claim_Settled, COUNT(Date_Claim_Settled) FROM Settlements GROUP BY Date_Claim_Settled ORDER BY Date_Claim_Settled DESC



 epoch num 1  step num 200 / 8000 loss training =0.8177073013782501 , val_loss = 0.7952540040016174
generated_response  : SELECT horse FROM table_19624708_1 WHERE owner = "Scott"<|endoftext|>
  ground_truth_reponse :  SELECT horse FROM table_19624708_1 WHERE owner = "R. A. Scott"



generated_response  : SELECT department__or_collectivity_ FROM table_name_54 WHERE department__or_collectivity_ = "guypel"<|endoftext|>
  ground_truth_reponse :  SELECT départment__or_collectivity_ FROM table_name_54 WHERE since = 2008 AND président = "guy-dominique kennel"



generated_response  : SELECT "Record" FROM table_51973 WHERE "Home" = 'February 21, 2008'<|endoftext|>
  ground_truth_reponse :  SELECT "Record" FROM table_51973 WHERE "Date" = 'february 21, 2008'



generated_response  : SELECT COUNT(born_in_a_non_eu_state__millions_) FROM table_name_32 WHERE total_population__millions_ = "62.008"<|endoftext|>
  ground_truth_reponse :  SELECT born_in_a_non_eu_state__millions_ FROM table_name_32 WHERE total_population__millions_ = 62.008



generated_response  : SELECT "Language" FROM table_71120 WHERE "Language" = 'arriba'<|endoftext|>
  ground_truth_reponse :  SELECT "Language" FROM table_71120 WHERE "Country" = 'argentina'



 epoch num 1  step num 250 / 8000 loss training =0.7823012614250183 , val_loss = 0.7820526003837586
generated_response  : SELECT firefox FROM table_name_22 WHERE opera = "1.8% opera" AND date = "30 July 2007"<|endoftext|>
  ground_truth_reponse :  SELECT firefox FROM table_name_22 WHERE opera = "1.8%" AND date = "30 july 2007"



generated_response  : SELECT home_team FROM table_name_15 WHERE home_team = "Footscray"<|endoftext|>
  ground_truth_reponse :  SELECT home_team AS score FROM table_name_15 WHERE home_team = "footscray"



generated_response  : SELECT replaced_by FROM table_17201869_3 WHERE outgoing_manager = "Jos ngel Ziganda"<|endoftext|>
  ground_truth_reponse :  SELECT replaced_by FROM table_17201869_3 WHERE outgoing_manager = "José Ángel Ziganda"



generated_response  : SELECT "game" FROM table_204_121 WHERE "year" = '1963-1973'<|endoftext|>
  ground_truth_reponse :  SELECT COUNT("game") FROM table_204_121 WHERE "year" >= 1963 AND "year" <= 1973



generated_response  : SELECT "Week" FROM table_72573 WHERE "Result" = '4-3'<|endoftext|>
  ground_truth_reponse :  SELECT "Result" FROM table_72573 WHERE "Week" = '4'



 epoch num 1  step num 300 / 8000 loss training =0.7694752466678619 , val_loss = 0.7761249423027039
generated_response  : SELECT common_name FROM table_name_44 WHERE iupac_name = "chloroform"<|endoftext|>
  ground_truth_reponse :  SELECT iupac_name FROM table_name_44 WHERE common_name = "chloroform"



generated_response  : SELECT country FROM table_name_62 WHERE city = "san juan"<|endoftext|>
  ground_truth_reponse :  SELECT country FROM table_name_62 WHERE city = "san juan"



generated_response  : SELECT COUNT(career_caps) FROM table_name_73 WHERE position = "half-back" AND tests > 3<|endoftext|>
  ground_truth_reponse :  SELECT career_caps FROM table_name_73 WHERE position = "half-back" AND tests > 3



generated_response  : SELECT "Vote" FROM table_72323 WHERE "Finish" = '10th voted out 3rd jury member day 30'<|endoftext|>
  ground_truth_reponse :  SELECT "Vote" FROM table_72323 WHERE "Finish" = '10th Voted Out 3rd Jury Member Day 30'



generated_response  : SELECT "Studio analysts" FROM table_10711 WHERE "Ice level reporters" = 'Scott Oake'<|endoftext|>
  ground_truth_reponse :  SELECT "Studio analysts" FROM table_10711 WHERE "Ice level reporters" = 'scott oake'



 epoch num 1  step num 350 / 8000 loss training =0.7520605337619781 , val_loss = 0.7411102920770645
generated_response  : SELECT opponent FROM table_name_28 WHERE week > 3 AND date = "september 23, 1960"<|endoftext|>
  ground_truth_reponse :  SELECT opponent FROM table_name_28 WHERE week < 3 AND date = "september 23, 1960"



generated_response  : SELECT "top ten places" FROM table_204_7 WHERE "film" = 'Top Ten'<|endoftext|>
  ground_truth_reponse :  SELECT "film" FROM table_204_7 ORDER BY "gross" DESC LIMIT 1



generated_response  : SELECT MAX("2004") FROM table_9822 WHERE "2009" > '26.1'<|endoftext|>
  ground_truth_reponse :  SELECT MAX("2004") FROM table_9822 WHERE "2009" > '26.1'



generated_response  : SELECT COUNT(played) FROM table_name_89 WHERE points_for = "369"<|endoftext|>
  ground_truth_reponse :  SELECT played FROM table_name_89 WHERE points_for = "369"



generated_response  : SELECT "male" OR "non_pregnant" FROM table_train_226 WHERE "pregnancy_or_lactation" = 'male' AND "active_metabolic" = 'non_pregnant'<|endoftext|>
  ground_truth_reponse :  SELECT * FROM table_train_226 WHERE gender = 'male' OR pregnancy_or_lactation = 0



 epoch num 1  step num 400 / 8000 loss training =0.7333637529611587 , val_loss = 0.7617270231246949
generated_response  : SELECT bronze FROM table_name_64 WHERE total > 16<|endoftext|>
  ground_truth_reponse :  SELECT MAX(bronze) FROM table_name_64 WHERE nation = "south africa (rsa)" AND total > 16



generated_response  : SELECT "English title" FROM table_15467 WHERE "English title" = 'zhang yimou'<|endoftext|>
  ground_truth_reponse :  SELECT "English title" FROM table_15467 WHERE "Director" = 'zhang yimou'



generated_response  : SELECT commercial_operation FROM table_name_27 WHERE construction_start = "jun 10, 1971"<|endoftext|>
  ground_truth_reponse :  SELECT commercial_operation FROM table_name_27 WHERE construction_start = "june 10, 1971"



generated_response  : SELECT "Captain" FROM table_14635 WHERE "Manager" = 'Joe Royle'<|endoftext|>
  ground_truth_reponse :  SELECT "Captain" FROM table_14635 WHERE "Manager" = 'joe royle'



generated_response  : SELECT COUNT("Losses") FROM table_66431 WHERE "Draws" > '0'<|endoftext|>
  ground_truth_reponse :  SELECT MAX("Losses") FROM table_66431 WHERE "Draws" > '0'



 epoch num 1  step num 450 / 8000 loss training =0.7036149162054062 , val_loss = 0.7275671482086181
generated_response  : SELECT Low_Estimate, SUM(Low_Estimate) FROM film JOIN market ON film_market_estimation.Film_ID = film_market_estimation.Film_ID GROUP BY SUM(Low_Estimate)<|endoftext|>
  ground_truth_reponse :  SELECT Low_Estimate, High_Estimate FROM film_market_estimation



generated_response  : SELECT country FROM table_name_23 WHERE _percentage_change_on_year = "5%" AND rank = "10"<|endoftext|>
  ground_truth_reponse :  SELECT country FROM table_name_23 WHERE _percentage_change_on_year > 5 AND rank = 10



generated_response  : SELECT height FROM table_20872722_1 WHERE position = "cir"<|endoftext|>
  ground_truth_reponse :  SELECT COUNT(height) FROM table_20872722_1 WHERE position = "Cornerback"



generated_response  : SELECT card_type_code, card_type_code FROM Customers_Cards ORDER BY card_type_code LIMIT 1<|endoftext|>
  ground_truth_reponse :  SELECT card_type_code, COUNT(*) FROM Customers_Cards GROUP BY card_type_code



generated_response  : SELECT District, COUNT(District) FROM phone_market ORDER BY COUNT(District)<|endoftext|>
  ground_truth_reponse :  SELECT District, COUNT(District) FROM phone_market AS T1 JOIN market AS T2 ON T1.Market_ID = T2.Market_ID JOIN phone AS T3 ON T1.Phone_ID = T3.Phone_ID GROUP BY District



 epoch num 1  step num 500 / 8000 loss training =0.7199257338047027 , val_loss = 0.705696451663971
generated_response  : SELECT AVG(gold) FROM table_name_28 WHERE nation = "yugoslavia" AND silver > 0<|endoftext|>
  ground_truth_reponse :  SELECT AVG(gold) FROM table_name_28 WHERE nation = "yugoslavia" AND silver > 0



generated_response  : SELECT MAX(press_jury) FROM table_20183474_1 WHERE artist = "Frank Aleksandersen"<|endoftext|>
  ground_truth_reponse :  SELECT MIN(press_jury) FROM table_20183474_1 WHERE artist = "Frank Aleksandersen"



generated_response  : SELECT "Week" FROM table_49502 WHERE "TV Time" = 'bye'<|endoftext|>
  ground_truth_reponse :  SELECT "Week" FROM table_49502 WHERE "TV Time" = 'bye'



generated_response  : SELECT total_matches FROM table_name_73 WHERE wickets < 537 AND career = 1898/99-1919/20 AND runs > 4476<|endoftext|>
  ground_truth_reponse :  SELECT COUNT(matches) FROM table_name_73 WHERE wickets < 537 AND career = "1898/99-1919/20" AND runs > 4476



generated_response  : SELECT population FROM table_16278673_1 WHERE municipality = "Srv gur"<|endoftext|>
  ground_truth_reponse :  SELECT population FROM table_16278673_1 WHERE municipality = "Sørvágur"



 epoch num 1  step num 550 / 8000 loss training =0.7227157914638519 , val_loss = 0.7186772227287292
generated_response  : SELECT authid, lname, authid FROM authorship AS T1 JOIN inst AS T2 ON T1.authid = T2.authid GROUP BY authid ORDER BY lname, authid DESC<|endoftext|>
  ground_truth_reponse :  SELECT DISTINCT t1.fname, t1.lname FROM authors AS t1 JOIN authorship AS t2 ON t1.authid = t2.authid JOIN inst AS t3 ON t2.instid = t3.instid WHERE t3.name = "University of Oxford"



generated_response  : SELECT "place" FROM table_204_524 WHERE "season" = 'top'<|endoftext|>
  ground_truth_reponse :  SELECT "place" FROM table_204_524 ORDER BY "place" LIMIT 1



generated_response  : SELECT "Place" FROM table_60922 WHERE "To par" = '+5' AND "Finish" = 'nick faldo'<|endoftext|>
  ground_truth_reponse :  SELECT "Finish" FROM table_60922 WHERE "Total" > '284' AND "To par" = '+5' AND "Player" = 'nick faldo'



generated_response  : SELECT "Partnering" FROM table_22092 WHERE "Date" = '10–12 july 2009'<|endoftext|>
  ground_truth_reponse :  SELECT "Partnering" FROM table_22092 WHERE "Date" = '10–12 July 2009'



generated_response  : SELECT "Home team" FROM table_55095 WHERE "Away team" = '15.16 (106)'<|endoftext|>
  ground_truth_reponse :  SELECT "Home team" FROM table_55095 WHERE "Home team score" = '15.16 (106)'



 epoch num 1  step num 600 / 8000 loss training =0.7114409577846527 , val_loss = 0.7005428850650788
generated_response  : SELECT COUNT("Number") FROM table_23455 WHERE "Last flown" = '19 april 1985'<|endoftext|>
  ground_truth_reponse :  SELECT COUNT("Number") FROM table_23455 WHERE "Last flew" = '19 April 1985'



generated_response  : SELECT "Time" FROM table_63357 WHERE "Name" = 'lisbeth trickett'<|endoftext|>
  ground_truth_reponse :  SELECT COUNT("Time") FROM table_63357 WHERE "Name" = 'lisbeth trickett'



generated_response  : SELECT AVG(runs) FROM table_name_1 WHERE matches = 1 AND average = 86<|endoftext|>
  ground_truth_reponse :  SELECT SUM(runs) FROM table_name_1 WHERE matches = 1 AND average < 86



generated_response  : SELECT AVG("Total") FROM table_35739 WHERE "2010" = '1st' AND "2010" = '2010' AND "2010" = '2010' AND "2010" = '2010' AND "2010" = '2010' AND "2010" = '2010' AND "2010" = '2010' AND "2010" = '2010' AND "2010" = '2010' AND "2010" = '2010' AND "2010" = '2010' AND
  ground_truth_reponse :  SELECT AVG("Total") FROM table_35739 WHERE "2010" = '1st'



generated_response  : SELECT enrollment FROM table_name_66 WHERE mascot = "cougars"<|endoftext|>
  ground_truth_reponse :  SELECT SUM(enrollment) FROM table_name_66 WHERE mascot = "cougars"



 epoch num 1  step num 650 / 8000 loss training =0.7010465693473816 , val_loss = 0.6671566396951676
generated_response  : SELECT "Successor" FROM table_26644 WHERE "District" = 'vacator' AND "Date successor seated" = 'june'<|endoftext|>
  ground_truth_reponse :  SELECT "Successor" FROM table_26644 WHERE "Vacator" = 'Vacant' AND "District" = 'Louisiana 5th'



generated_response  : SELECT "Week" FROM table_65974 WHERE "Partner" = 'endre jansen'<|endoftext|>
  ground_truth_reponse :  SELECT MAX("Week") FROM table_65974 WHERE "Result" = 'bottom 3' AND "Partner" = 'endre jansen'



generated_response  : SELECT "Site" FROM table_39349 WHERE "Attendance" = '54,040'<|endoftext|>
  ground_truth_reponse :  SELECT "Game Site" FROM table_39349 WHERE "Attendance" = '54,040'



generated_response  : SELECT MAX("Overall") FROM table_4598 WHERE "Player" = 'kentucky state'<|endoftext|>
  ground_truth_reponse :  SELECT MAX("Overall") FROM table_4598 WHERE "College" = 'kentucky state'



generated_response  : SELECT COUNT(canton) FROM table_1417184_1 WHERE commune = "Waldbillig"<|endoftext|>
  ground_truth_reponse :  SELECT COUNT(canton) FROM table_1417184_1 WHERE commune = "Waldbillig"



 epoch num 1  step num 700 / 8000 loss training =0.7030067455768585 , val_loss = 0.6656216979026794
generated_response  : SELECT "Home team" FROM table_46925 WHERE "Away team" = 'aston villa'<|endoftext|>
  ground_truth_reponse :  SELECT "Home team" FROM table_46925 WHERE "Away team" = 'aston villa'



generated_response  : SELECT AVG("Rank") FROM table_57342 WHERE "Total" > '4'<|endoftext|>
  ground_truth_reponse :  SELECT AVG("Rank") FROM table_57342 WHERE "Total" > '4' AND "Nation" = 'great britain'



generated_response  : SELECT "Nationality" FROM table_56361 WHERE "Player" = 'kent perry'<|endoftext|>
  ground_truth_reponse :  SELECT "Nationality" FROM table_56361 WHERE "Player" = 'kent patterson'



generated_response  : SELECT "City" FROM table_75106 WHERE "Team" = 'target center arena'<|endoftext|>
  ground_truth_reponse :  SELECT "City" FROM table_75106 WHERE "Home Arena" = 'target center'



generated_response  : SELECT COUNT("total") FROM table_203_151 WHERE "winning score" = '0'<|endoftext|>
  ground_truth_reponse :  SELECT COUNT(*) FROM table_203_151



 epoch num 1  step num 750 / 8000 loss training =0.6565036427974701 , val_loss = 0.6751508772373199
generated_response  : SELECT district FROM table_1342233_24 WHERE incumbent = "Jamie L. Whitten"<|endoftext|>
  ground_truth_reponse :  SELECT district FROM table_1342233_24 WHERE incumbent = "Jamie L. Whitten"



generated_response  : SELECT "Opposition" FROM table_5766 WHERE "City" = 'taunton'<|endoftext|>
  ground_truth_reponse :  SELECT "Opposition" FROM table_5766 WHERE "City" = 'taunton'


